ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
/*
 * Copyright (c) 2015-2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>

/*
 * By default disable both asserts and log for this module.
 * This must be done before DebugP.h is included.
 */
#ifndef DebugP_ASSERT_ENABLED
#define DebugP_ASSERT_ENABLED 0
#endif
#ifndef DebugP_LOG_ENABLED
#define DebugP_LOG_ENABLED 0
#endif

#ifndef min
#define min(a,b) ((a)<(b)?(a):(b))
#endif
#ifndef max
#define max(a,b) ((a)>(b)?(a):(b))
#endif

#include <ti/devices/DeviceFamily.h>
#include <ti/devices/msp432p4xx/inc/msp.h>

#include <ti/drivers/dpl/DebugP.h>
#include <ti/drivers/dpl/HwiP.h>
#include <ti/drivers/dpl/SemaphoreP.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerMSP432.h>
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTMSP432DMA.h>
#include <ti/drivers/Timer.h>
#include <ti/drivers/timer/TimerMSP432.h>

/* driverlib header files */
#include <ti/devices/msp432p4xx/driverlib/rom.h>
#include <ti/devices/msp432p4xx/driverlib/rom_map.h>
#include <ti/devices/msp432p4xx/driverlib/dma.h>
#include <ti/devices/msp432p4xx/driverlib/pmap.h>
#include <ti/devices/msp432p4xx/driverlib/uart.h>
#include <ti/devices/msp432p4xx/driverlib/gpio.h>
#include <ti/devices/msp432p4xx/driverlib/timer32.h>

#include <SEGGER_SYSVIEW_uartdma.h>
#include <SEGGER_SYSVIEW.h>

/* Used to indicate more bytes required, use int to count */
#define UART_INT_RX EUSCI_A_UART_STARTBIT_INTERRUPT
#define UART_DBL_BUF_CH     3

/* Helper enum for Rx DMA scatter gatherer DMA task actions */
typedef enum {
    eTask1TriggerPingPongDMA = 0,
    eTask2ReloadIdleTimeout,
    eTask3RearmIdleTimer,
    eTask4ResetTaskCount,
    eTaskMax
} eRxDmaTasks;

#define MAX_DMA_TRANSFER_AMOUNT (1024)

#define PinConfigValue(config) (((config) >> 10) & 0x1F)
#define PinConfigModuleFunction(config) (((config) >> 8) & 0x3)
#define PinConfigPort(config) (((config) >> 4) & 0xF)
#define PinConfigPin(config) (1 << ((config) & 0x7))

/* UARTMSP432 functions */
void UARTMSP432DMA_close(UART_Handle handle);
int_fast16_t UARTMSP432DMA_control(UART_Handle handle, uint_fast16_t cmd, void *arg);
void UARTMSP432DMA_init(UART_Handle handle);
UART_Handle UARTMSP432DMA_open(UART_Handle handle, UART_Params *params);
int_fast32_t UARTMSP432DMA_read(UART_Handle handle, void *buffer, size_t size);
long UARTMSP432DMA_readCancel(UART_Handle handle);
int_fast32_t UARTMSP432DMA_readPolling(UART_Handle handle, void *buffer, size_t size);
int_fast32_t UARTMSP432DMA_write(UART_Handle handle, const void *buffer, size_t size);
void UARTMSP432DMA_transmitCancel(UART_Handle handle);
int_fast32_t UARTMSP432DMA_writePolling(UART_Handle handle, const void *buffer, size_t size);
static int32_t findBaudDividerIndex(UARTMSP432DMA_BaudrateConfig const *table, uint32_t tableSize, uint32_t baudrate,
                                    uint32_t clockFreq);
static void initHw(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs, uint32_t inputClkFreq);
static int perfChangeNotifyFxn(unsigned int eventType, uintptr_t eventArg, uintptr_t clientArg);
static long UARTMSP432DMA_timeoutIntRx(Timer_Handle handle, uintptr_t arg);
inline uint32_t getDmaRemainingTXfers(UARTMSP432DMA_Object *object);
inline uint32_t getDmaRemainingRXfers(UARTMSP432DMA_Object *object);
inline void UARTMSP432DMA_ReadPingPongPeek(UART_Handle handle);
static long UARTMSP432DMA_hwiIntFxn(uintptr_t arg);
// Inline (mock) interrupt routine, called from ISR
static long UARTMSP432DMA_hwiIntRx(uintptr_t arg);
static long UARTMSP432DMA_hwiIntRxDMA_done(uintptr_t arg);
static long UARTMSP432DMA_hwiIntTxDMA_done(uintptr_t arg);
static void mapPin(uint8_t port, uint8_t pin, uint8_t value);
static int configTransmitDMA(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs);
static void InitDmaRxScatterGatherer(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs);

/* UART function table for UARTMP432 implementation */
const UART_FxnTable UARTMSP432DMA_fxnTable =
{   UARTMSP432DMA_close,
    UARTMSP432DMA_control,
    UARTMSP432DMA_init,
    UARTMSP432DMA_open,
    UARTMSP432DMA_read,
    UARTMSP432DMA_readAsync,
    UARTMSP432DMA_readPolling,
    UARTMSP432DMA_readCancel,
    UARTMSP432DMA_write,
    UARTMSP432DMA_writePolling,
    UARTMSP432DMA_transmitCancel
};

static const uint16_t stopBits[] =
{
    EUSCI_A_UART_ONE_STOP_BIT, /* UART_STOP_ONE */
    EUSCI_A_UART_TWO_STOP_BITS /* UART_STOP_TWO */
};

static const uint8_t parityTypes[] =
{
    EUSCI_A_UART_NO_PARITY, /* UART_PAR_NONE */
    EUSCI_A_UART_EVEN_PARITY, /* UART_PAR_EVEN */
    EUSCI_A_UART_ODD_PARITY, /* UART_PAR_ODD */
    0, /* UART_PAR_ZERO */
    1 /* UART_PAR_ONE */
};

