ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
/*
 *  ======== findBaudDividerIndex ========
 *  This function searchs a given array of different baudrate configurations to
 *  find the first compatible match given the desired buadrate and the currently
 *  configured clock input frequency.
 *
 *  It return the index in if the UARTMSP432DMA_BaudrateConfig table if a match was
 *  found, else it will return -1
 */
static int32_t findBaudDividerIndex(UARTMSP432DMA_BaudrateConfig const *table, uint32_t tableSize, uint32_t baudrate, uint32_t clockFreq)
{
    int32_t index;

    DebugP_assert((tableSize != 0) && (table != NULL));

    for (index = 0; index < tableSize; index++)
    {
        if ((table[index].outputBaudrate == baudrate) && (table[index].inputClockFreq == clockFreq))
        {
            return (index);
        }
    }
    return (-1);
}

/*
 *  ======== UARTMSP432DMA_hwiIntRxDMA_done ========
 *  This routine gets called when a Rx ping pong buffer has been finished
 *  and needs to be reset with valid data. The next buffer should already be
 *  switched in so it only resets the currently complete buffer.
 */
static long UARTMSP432DMA_hwiIntRxDMA_done(uintptr_t arg)
{
    UARTMSP432DMA_Object *object = ((UART_Handle) arg)->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = ((UART_Handle) arg)->hwAttrs;
    uintptr_t key;
    size_t overflow, transferSize ;
    eUDMAPingPong eBuffer;
    uint32_t dmaChannel;

    /* Pre-peek/done lock */
    key = HwiP_disable();

    /* Check which is the active DMA, primary or alternate, As this is a completion event the transfer
     * size is in the opposite to the active DMA channel
     */
    if (*object->rx_dmaAltSetBitBand) {
        dmaChannel = object->rx_transfer.dmaChannel | UDMA_PRI_SELECT;
        eBuffer = eUDMAPingPongPrimary;
    } else {
        dmaChannel = object->rx_transfer.dmaChannel | UDMA_ALT_SELECT;
        eBuffer = eUDMAPingPongAlternate;
    }
    transferSize = object->rx_transfer.specs[eBuffer].size;
    object->rx_transfer.specs[eBuffer].size = 0;

    MAP_DMA_clearInterruptFlag(hwAttrs->bfrDMAChannelIndex & 0x0F);

    /* Call the put_dma_size routine which will advance the head and enable the full size to be read,
     * also deducting the current readPutPeek variable as other calls to PEEK have incremented this value
     * and WE do not want to double count bytes, so deduct this figure, also guard against a zero size
     * by checking if the readPutPeek is less than the transfer size */
    if ( transferSize ) {
        overflow = RingBuf_free_put_contiguous(&object->readBuffer, transferSize );
    } else {
        overflow = 0;
    }

    /* Calculate the next ring buffer transfer size given the unallocated ring buffer available, accounting
     * for two buffers in size to allocate, as allocating a single 256 byte buffer then 16 byte is not wise.
     * Taking the 256+16 / 2 approach allows the size to incrementally decrease as buffer space runs out until
     * ring min is met. At that point activate the all stop before we overrun the buffer and cause all sorts of
     * problems.
     */
    transferSize = object->ringBlkSize;
    while (transferSize >= (RingBuf_getUnallocated(&object->readBuffer) >> 1 ) && transferSize >= object->ringBlkSizeMin )
    {
       transferSize >>= 1;
    }

    /* Check if we have an overflow OR a buffer full condition. In which case assert the RTS pin if it exists and then
     * mask off the DMA channel so no more requests come in to cause an overflow if we're a buffer full situation
     */
    if ( overflow != 0
     ||  transferSize <= object->ringBlkSize ) {
        /* If we're not overflowed, but we are full, we need to toggle the RTS pin if its configured,
         * to prevent more bytes from overflowing the buffer.. but it could be too late already, technically
         * the rxBuf of the eUSCI will still contain the last byte read
         */
        if (object->rtsPinBitBand != NULL ) {
           *object->rtsPinBitBand = 0x0001;
        }

        if (transferSize < object->ringBlkSizeMin) {
            /* Mask down the rxChannel because the buffer is full and we can no longer receive more bytes. As we are asserting the
            * RTS pin, the next byte should be buffered in UART_A2->rxBuf until the the channel is re-enabled, this will prevent an
            * overflow of the RX buffer
            */
            DMA_Control->REQMASKSET = 1 << (hwAttrs->rxDMAChannelIndex & 0x0F);
        }
    }

    /* Toggle the ping-pong buffer so that the secondary buffer has a valid pointer and transfer size for the auto swap-over
     * on buffer filling. The ring buffer is divided up into read sprints of a much smaller size than the total ring buffer.
     * This should allow the DMA interrupt routines to catch a potential buffer overflow before it occurs, which will pause
     * the current transaction routines, allowing the caller time to clear down the buffer before resuming, and releasing the
     * RTS signal to the remote host.
     */
    object->rx_transfer.specs[eBuffer].size =
            RingBuf_alloc_put_contiguous(&object->readBuffer, transferSize, (unsigned char **)&object->rx_transfer.specs[eBuffer].dst );
    MAP_DMA_setChannelControl(dmaChannel, object->rx_transfer.ctlOptions);
    MAP_DMA_setChannelTransfer(dmaChannel, UDMA_MODE_PINGPONG, object->rx_transfer.specs[eBuffer].src, object->rx_transfer.specs[eBuffer].dst, object->rx_transfer.specs[eBuffer].size);

    /*
     * The Ping-Pong buffer is always setup for continual transfers and can overrun if no flow control is implemented within the hardware
     * layer. This is why the above code asserts the RTS flag and always maintains at least one ping-ping block from end-of-buffer. This
     * may be a little wasteful but offers great protection against buffer overrun and allows ample time for servicing of this interrupt
     * while more data could be arriving at warp like speeds.
     */

    /* Check if we have an actual overflow condition here. If we do then we must alert the caller that this has occurred
     * so the necessary actions can be taken to restart the communications channel
     */
    if (overflow != 0) {
        /* Reduce the size of the readPrevious because the overflow has caused the tail
         * pointer to increase, and thus free the buffer. This prevents a double "free"
         * action on the ping-pong buffer, which would consume bytes where we /may/ not
         * want to. We've certainly lost bytes already so.... its not a GOOD situation to
         * be in..
         */
        if (object->readAsyncPrev <= overflow) {
            object->readAsyncPrev = 0;
        } else {
            object->readAsyncPrev-= overflow;
        }

        /* Post-peek/done unlock */
        HwiP_restore(key);

        /* Buffer overflow condition.. the callback function needs to be called */
        hwAttrs->errorFxn((UART_Handle) arg, EUSCI_A_UART_OVERRUN_ERROR);
    } else {
        /* Post-peek/done unlock */
        HwiP_restore(key);
    }

