ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /*
     * unblock the reader if they're waiting for data, has no effect if there are no callers waiting.
     */
    return SemaphoreP_post(object->readSem);
}

/*
 * ======== UARTMSP432DMA_ReadPingPongPeek ========
 *
 * This inline routine peaks into the ping-pong buffer DMA structures and advanced the stored bytes
 * based upon how many DMA transfers remaining for either the Alternate or Primary structure
 *
 * Note: Always call this function within a "key = Hwip_disable(); .... ; HwiP_restore(key);"
 * locking context. As the variables accessed are not locked within nested routines for speed
 * reasons.
 *
 */
inline void UARTMSP432DMA_ReadPingPongPeek(UART_Handle handle)
{
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;
    size_t overflow, transfered;
    uint32_t ctrlBufr;
    eUDMAPingPong eBuffer;

    /* Check if either the Alternate or Primary DMA structure is being executed
     * by the DMA controller. If a structure is stopped, then the remaining count
     * is zero, otherwise its ((control & mask) >> 4 ) + 1
     *
     * Buffer the control structure value in case a race-condition occurs and the
     * value changes by one during calculation, as this routine cannot block DMA
     * actions for happening in parallel
     *
     * And yes this makes a difference... 750k baud confirms this occurs
     */
    if (*object->rx_dmaAltSetBitBand) {
        ctrlBufr = *object->rx_dmaCtrlAlt;
        eBuffer = eUDMAPingPongAlternate;
    } else {
        ctrlBufr = *object->rx_dmaCtrlPri;
        eBuffer = eUDMAPingPongPrimary;
    }
    transfered = object->rx_transfer.specs[eBuffer].size - (ctrlBufr & 0x07 ? ((ctrlBufr & UDMA_CHCTL_XFERSIZE_M) >> 4) + 1 : 0);
    object->rx_transfer.specs[eBuffer].size -= transfered;

    /* Call the put_dma_size routine which will advance the head and enable the full size to be read,
     * also deducting the current readPutPeek variable so WE do not double up on advancement */
    if ( transfered ) {
        overflow = RingBuf_free_put_contiguous(&object->readBuffer, transfered );
    } else {
        overflow = 0;
    }

    /* Check if we have an overflow OR a buffer full condition. In which case assert the RTS pin if it exists and then
     * mask off the DMA channel so no more requests come in to cause an overflow if we're a buffer full situation.
     *
     * + DMA Requests are blocked once free space is <= ringBlkSizeMin
     * + RTS is asserted once free space is <= ringBlkSize
     */
    if ( overflow != 0
     ||  object->readBuffer.count >= ( object->readBuffer.length - object->ringBlkSize ) ) {
        /* If we're not overflowed, but we are full, we need to toggle the RTS pin if its configured,
         * to prevent more bytes from overflowing the buffer.. but it could be too late already, technically
         * the rxBuf of the eUSCI will still contain the last byte read
         */
        if (object->rtsPinBitBand != NULL) {
           *object->rtsPinBitBand = 0x0001;
        }

        if (object->readBuffer.count >= ( object->readBuffer.length - object->ringBlkSizeMin )) {
            /* Mask down the rxChannel because the buffer is full and we can no longer receive more bytes. As we are asserting the
             * RTS pin, the next byte should be buffered in UART_A2->rxBuf until the the channel is re-enabled, this will prevent an
             * overflow of the RX buffer
             */
            DMA_Control->REQMASKSET = 1 << (hwAttrs->rxDMAChannelIndex & 0x0F);
        }
    }

    /* Check if we have an actual overflow condition here. If we do then we must alert the caller that this has occurred
     * so the necessary actions can be taken to restart the communications channel
     */
    if (overflow != 0) {
        /* Reduce the size of the readPrevious because the overflow has caused the tail
         * pointer to increase, and thus free the buffer. This prevents a double "free"
         * action on the ping-pong buffer, which would consume bytes where we /may/ not
         * want to. We've certainly lost bytes already so.... its not a GOOD situation to
         * be in..
         */
        if (object->readAsyncPrev <= overflow) {
            object->readAsyncPrev = 0;
        } else {
            object->readAsyncPrev -= overflow;
        }

        /* Buffer overflow condition.. the callback function needs to be called */
        hwAttrs->errorFxn(handle, EUSCI_A_UART_OVERRUN_ERROR);
    }
}

/*
 * ======== UARTMSP432DMA_hwiIntRx ========
 * This function hook is the DMA Done call for the RX Scatter Gatherer call. If
 * this executes then something bad has happened to make the channel actually
 * complete, Its never meant to complete. It should loop indefinately without
 * return, thus this is a system error. The receive channel should be reset
 * back to its original tasking from the InitHW call. Log a message for diagnostics
 */
static long UARTMSP432DMA_hwiIntRx(uintptr_t arg)
{
    UARTMSP432DMA_Object *object = ((UART_Handle) arg)->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = ((UART_Handle) arg)->hwAttrs;
    uintptr_t key;

    /* Always manually clear down the DMA channel otherwise it wont clear */
    MAP_DMA_clearInterruptFlag(hwAttrs->rxDMAChannelIndex & 0x0F);

    key = HwiP_disable();

    /* Setup the channel again... this should never happen */
    InitDmaRxScatterGatherer(object, hwAttrs);

    HwiP_restore(key);

    return 0;
}

/*
 *  ======== UARTMSP432DMA_timeoutIntRx ========
 *  Stop any active read operations, clean up buffers and tally remaining
 *  counts so any unblocked read operation gets the correct buffers
 *
 *  Also setup DMA to transfer back in the scratchpad area
 *
 */

static long UARTMSP432DMA_timeoutIntRx(Timer_Handle handle, uintptr_t arg)
{
    UARTMSP432DMA_Object *object = ((UART_Handle) arg)->object;
    uintptr_t key;

    /* Pre-peek lock */
    key = HwiP_disable();

    /* Perform a read ping-pong peek so the true size of the receive buffer
     * is known before the semaphore is posted, unblocking the reader
     */
    UARTMSP432DMA_ReadPingPongPeek((UART_Handle)arg);

    if (object->readBuffer.count >= object->rx_readMin
    && object->rx_readMin) {
        object->state.bufTimeout = false;
    } else {
        object->state.bufTimeout = true;
    }

    /* Post-peek unlock */
    HwiP_restore(key);

    return SemaphoreP_post(object->readSem);
}

