ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
/*
 *  ======== UARTMSP432DMA_readAsync ========
 *
 *  This function will return once a single character has been read if the known size is zero,
 *  otherwise it will attempt to set timeouts or use interrupt counts to get the right return size.
 *
 *  The buffer will be passed back to the reader for consumtion, it should not be held beyond the
 *  very next read operation. It will take anoher read to remove the buffer from the held list and
 *  continue on.
 *
 */
int_fast32_t UARTMSP432DMA_readAsync(UART_Handle handle, size_t request, int release, volatile uint8_t **buffer, size_t *size)
{
    uintptr_t key;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartReadAsyncEnter, (uintptr_t)handle, request, release);

    /*
     * It is possible for the object->timeoutClk and the callback function to
     * have posted the object->readSem Semaphore from the previous UART_read
     * call (if the code below didn't get to stop the clock object in time).
     * To clear this, we simply do a NO_WAIT pend on (binary) object->readSem
     * so that it resets the Semaphore count.
     */
    SemaphoreP_pend(object->readSem, SemaphoreP_NO_WAIT);
    object->state.bufTimeout = false;

    /* Pre-peek lock */
    key = HwiP_disable();

    /* Perform a read ping-pong peek so the true size of the receive buffer
     * is known before the semaphore is posted, unblocking the reader
     */
    UARTMSP432DMA_ReadPingPongPeek(handle);

    /* Free the previous buffer by advancing the ring tail forward
     * by the number of bytes specified in "release". One cannot
     * release more bytes than has been read previously.
     * Note: to empty the existing buffer the caller should use the
     * control functions to flush buffers
     */
    if (object->readAsyncPrev && release)
    {
        /* Allows an anonymouse, release everything thats been returned before
         * so the client doesn't always have to track the last read amount
         */
        if (release == -1) {
            release = object->readAsyncPrev;
        } else  if (release > object->readAsyncPrev) {
        /* Limit release to the size of readPrevious
         * as we cannot possibly release more bytes
         * than we actually how outstanding */
            release = object->readAsyncPrev;
        }

        /* Further limit the release amount to the actual size of the current ring buffer
         * as the limits are not enforced within the nested functions
         */
        if (release <= object->readBuffer.count) {
            RingBuf_get_dma(&object->readBuffer, release);
        } else {
            RingBuf_get_dma(&object->readBuffer, object->readBuffer.count);
        }
    }

    /* Check if we've met the RTS flow on control state here and not within the read-wait loop
     * because here is the only place the receive buffer is actually cleared down, because the
     * return from this call passes the receive buffer back to the caller directly, saving on
     * memory copy calls. So really here is the only place within the function that could satify
     * an RTS on condition. And we're already under a locking scenario, and just checked the ping
     * pong peek, so we're pretty sure that we have a good understanding of how much data is in
     * the receive buffer waiting to be read.
     */
    if (object->readBuffer.count < (object->readBuffer.length - object->ringBlkSizeMin))
    {
        /* Check if we can also un-mask the receive channel in case we were either disabled or
         * previously masked due to overflow condition met
         */
        if (DMA_Control->REQMASKSET & (1 << (hwAttrs->rxDMAChannelIndex & 0x0F)))
        {
            DMA_Control->REQMASKCLR = (1 << (hwAttrs->rxDMAChannelIndex & 0x0F));

            /* We have just unmasked the DMA channel, it could now have a pending transfer
             * which has not been auctioned because the channel was masked before the interrupt
             * Occurred. Manually trigger the DMA channel to spring life back into the receive
             * DMA transaction machine
             */
            if (MAP_UART_getInterruptStatus(hwAttrs->baseAddr, EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG))
            {
                DMA_Control->SWREQ = (1 << (hwAttrs->rxDMAChannelIndex & 0x0F));
            }
        }

        /* Check to see if we also need to lower the RTS flag, always after we manually trigger the
         * DMA channel in case the RTS clearing causes more bytes to come in, in which case we could
         * receive a byte in between calling software request and returning from lowering the flag
         */
        if (object->readBuffer.count < (object->readBuffer.length - object->ringBlkSize) && object->rtsPinBitBand != NULL) {
            *object->rtsPinBitBand = 0x0000;
        }
    }

    /* Post-peek unlock */
    HwiP_restore(key);

    /* Restrict the request to half the ring size otherwise
     * the loop functions below may loop beyond the ability of the
     * ping-pong buffer to hold */
    if (request >= (object->readBuffer.length - object->ringBlkSizeMin)) {
        request = object->readBuffer.length - object->ringBlkSizeMin;
    }

    if (request == 0) {
        /* If we have bytes in the input ping-pong already, then
         * we do not wait, we return everything we have so it can
         * be inspected immediately, because we've called with zero
         * requested..
         */
        if (!object->readBuffer.count) {
            object->rx_readMin = 1;
            /* Enable the timer because we've been asked to read a minimum
             * of zero bytes, thus the timer wont start automatically and
             * we will never return. So start it now incase it doesn't start
             * later on
             */
            Timer_start(object->timeoutTmr);

            /* Wait on the semaphore for more bytes before returning.
             * This will be either triggered from the above timer or
             * if enough bytes ( >= object->readMin ) have been read
             * in the background from a combination of DMA interrupt
             * and timeout. Which ever occurs first.
             */
            SemaphoreP_pend(object->readSem, SemaphoreP_WAIT_FOREVER);
        }
    } else if (request > object->readBuffer.count) {
        /* if we have requested MORE bytes than there are in the current
         * ping-pong buffer, then we MUST wait (or timeout) for more data
         * as we've been told to explicitly try for more bytes.. Its likely
         * the caller needs that many more bytes to determine the next or
         * current packet header. This saves on excess call / return when
         * the amount of more data required is known
         */
        object->rx_readMin = request;
        //Timer_start(object->timeoutTmr);
        /*
         * Loop until we have a ring buffer size >= requested, or we experienced a buffer timeout.
         * Note: the timer is setup by the Rx DMA Scatter Gatherer channel to be ~ 4x the Rx frame
         * length in clock cycles. Thus a continuous stream of bytes should be un-interrupted
         */
        while (object->readBuffer.count < request && !object->state.bufTimeout) {
            /* Start the timer if bytes have been requested and we have ANY bytes in the queue as this
             * is a AsyncRead call, and when requested we timeout from the reception of the first (or subsequent bytes)
             */
            if (object->readBuffer.count) {
                /* Start the timer, or again, as we've either expired a read sequence or this
                 * is our first iteration through and we have bytes in our buffer, so we are going
                 * to return the the caller with the buffer on a timeout, or directly after a byte
                 * stream is received
                 * Note: This timer count will be overwritten by the Rx DMA Scatter Gatherer continuously
                 * while receiving characters from the UART, meaning a stream of data will push out this
                 * timeout until a DMA buffer toggles ping-pong, so quite large potentially?
                 * ~ > (ring_buffer_size / 2). But really, if the timeout value has been configured as
                 * 10ms, then 1,150 bytes will be received in this time, which is likely greater than
                 * the size of the ring-buffer anyway... so we will get notification
                 */
                Timer_start(object->timeoutTmr);
            }

            /* Wait for the DMA or timer callback to strike */
            SemaphoreP_pend(object->readSem, SemaphoreP_WAIT_FOREVER);
        }
    } else {
        /* The number of bytes requested is equal to the size of the ping-pong buffer
         * or less than the size required, so we can just fall through here and return
         * what we have in the buffer..
         * Note: we already return the MAXIMUM amount in the buffer.. In a continuous buffer
         * that is.. Non-continuous buffers are handled over multiple calls to the AsyncRead
         * function.
         */
        object->rx_readMin = 0;
    }

    /* Get a continuous buffer from the ping-pong, this does not decrease the buffer count until
     * the read is consumed by a further calls to AsyncRead. The buffer returned is a direct
     * pointer into the read ringbuffer as is considered volatile beyond the scope of the return
     * call. Only another read operation, with the parameter "release" size as the last read-size
     * will advance the ring buffer forward.
     * Note: Not releasing the buffer will allow/cause the ping-pong to overwrite the ring buffer
     * contents if not released.
     */
    *size = object->readAsyncPrev = RingBuf_peek_contiguous(&object->readBuffer, (uint8_t**)buffer);

