ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /*
     * Return back the total size of the ring-buffer so the caller knows how much data is pending to be
     * parsed. This size differs from the *size and readPrevious because because the returned buffer is
     * a continuous block of memory of *size. This saved on memory copy actions between driverlib and
     * caller, and any deeper layers behind the caller, but does allow the possibility of a buffer overflow
     * corrupting the buffer returned above.
     * Note: Take caution and consume the returned buffer immediately! Be sure to call ReadAsync with the
     * release parameter equal the the size of buffer returned previously, otherwise the ring-buffer will
     * fill up until it overflows, before setting the RTS pin.
     * Note: The DMA hardware interrupt routine may set the RTS pin when the ring-buffer is filling up.
     */
    SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartReadAsyncExit, (uintptr_t)handle, object->readAsyncPrev, object->readBuffer.count );
    return object->readBuffer.count;
}

/*
 *  ======== UARTMSP432DMA_read ========
 */
int_fast32_t UARTMSP432DMA_read(UART_Handle handle, void *buffer, size_t size)
{
    uintptr_t key;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;
    uint32_t readCount = 0, bfr_size;
    uint8_t *readBuffer = (uint8_t*)buffer;
    uint8_t *ringBuffer;

    SEGGER_SYSVIEW_RecordU32x2(SYSVIEW_EID_uartReadEnter, (uintptr_t)handle, size);

    /*
    * It is possible for the object->timeoutClk and the callback function to
    * have posted the object->readSem Semaphore from the previous UART_read
    * call (if the code below didn't get to stop the clock object in time).
    * To clear this, we simply do a NO_WAIT pend on (binary) object->readSem
    * so that it resets the Semaphore count.
    */
    SemaphoreP_pend(object->readSem, SemaphoreP_NO_WAIT);
    object->state.bufTimeout = false;

    /* Pre-peek lock */
    key = HwiP_disable();

    /* Check if we have a lingering readPrevious to take care of, as we're performing
     * a synchronous read we need to disband with the Async methods and clear down
     * any flags hanging over
     */
    if (object->readAsyncPrev)
    {
        /* Further limit the release amount to the actual size of the current ring buffer
        * as the limits are not enforced within the nested functions
        */
        if (object->readAsyncPrev <= object->readBuffer.count) {
            RingBuf_get_dma(&object->readBuffer, object->readAsyncPrev);
        } else {
            RingBuf_get_dma(&object->readBuffer, object->readBuffer.count);
        }
        object->readAsyncPrev = 0;

        /* No need to check for a RTS release condition here because the while
         * loop below will capture that check if it reads a single character,
         * which it will if there is enough data to actually cause a RTS assertion
         */
    }

    /* Perform a read ping-pong peek so the true size of the receive buffer
     * is known before the semaphore is posted, unblocking the reader
     */
    UARTMSP432DMA_ReadPingPongPeek(handle);

    /* Post-peek unlock */
    HwiP_restore(key);

    /* Handle special "Flush" read buffer. Null buffer and zero size.
     * Otherwise a NULL buffer is valid, and will act like a read but
     * throw away the data
     */
    if (buffer == NULL && size == 0 && object->readBuffer.count)
    {
        size = object->readBuffer.count;
        RingBuf_get_dma(&object->readBuffer, object->readBuffer.count);

        /* Shoot back the size so the client knows how many bytes were just purged */
        return size;
    }

    /* if we have requested MORE bytes than there are in the current
     * ping-pong buffer, then we MUST wait (or timeout) for more data
     * as we've been told to explicitly try for more bytes.. Its likely
     * the caller needs that many more bytes to determine the next or
     * current packet header. This saves on excess call / return when
     * the amount of more data required is known
     */
    object->rx_readMin = 1;

    /* The read-wait-timeout loop will execute so long as there are bytes
     * in the receive queue, we're not timed-out and we have more bytes
     * to read. So even if we're timed out, we'll still loop around while
     * there are more bytes to shift into the callers buffer.. because each
     * read cycle could get a continuous buffer which wraps the ring buffer
     * leaving more bytes to be returned on the very next call.
     */
    while ( size && (object->readBuffer.count || !object->state.bufTimeout) )
    {
        /* Read out as many bytes as possible on entry
         * and then wait on the semaphore if more data
         * is required to be read. Reading and performing a
         * memcpy as data arrives makes processing more efficient
         * and prevents the read buffer from overflowing
         */
        if (object->readBuffer.count) {
            /* Get a continuous buffer from the ring and cap it at the remaining size */
            if ( (bfr_size = RingBuf_peek_contiguous(&object->readBuffer, &ringBuffer)) > size ) {
                bfr_size = size;
            }

            /* Handle effective read to NULL. Don't actually copy unless we have a buffer, otherwise
             * act like we do... just copy nothing
             */
            if (readBuffer != NULL) {
                /* Copy across the read buffer into the callers supplied buffer */
                memcpy(readBuffer, ringBuffer, bfr_size);
                readBuffer += bfr_size;
            }
            /* Skip the number of bytes just copied to the callers buffer. Call the DMA
             * version of the ring buffer skip, because we are not in control of where
             * the DMA will write to next, so we cannot reset the head and tail back to
             * zero because the Ping-Ping receive buffer pointers have already been defined
             * and may execute while this is executing. One cannot pull the rug
             * from underneath the DMA controller, otherwise it will byte you... ha...
             */
            RingBuf_get_dma(&object->readBuffer, bfr_size);

