ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
            /* Copy out as many bytes as we can into our buffer then increment
             * the pointer and decrement the size */
            readCount += bfr_size;
            size -= bfr_size;

            /* Asses the size of the read buffer, and if its dropped below the high water mark
             * then check if we need to trigger a DMA cycle and unmask the DMA channel
             */
            if (object->readBuffer.count < (object->readBuffer.length - object->ringBlkSize))
            {
                /* Check to see if we also need to lower the RTS flag, always after we manually trigger the
                 * DMA channel in case the RTS clearing causes more bytes to come in, in which case we could
                 * receive a byte in between calling software request and returning from lowering the flag
                 */
                if (object->rtsPinBitBand != NULL) {
                    *object->rtsPinBitBand = 0x0000;
                }

                /* Check if we can also un-mask the receive channel in case we were either disabled or
                 * previously masked due to overflow condition met
                 */
                if (DMA_Control->REQMASKSET & (1 << (hwAttrs->rxDMAChannelIndex & 0x0F)))
                {
                    /* Pre-flow-on lock */
                    key = HwiP_disable();

                    DMA_Control->REQMASKCLR = 1 << (hwAttrs->rxDMAChannelIndex & 0x0F);

                    /* We have just unmasked the DMA channel, it could now have a pending transfer
                     * which has not been auctioned because the channel was masked before the interrupt
                     * Occurred. Manually trigger the DMA channel to spring life back into the receive
                     * DMA transaction machine
                     */
                    if (MAP_UART_getInterruptStatus(hwAttrs->baseAddr, EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG))
                    {
                        DMA_Control->SWREQ = (1 << (hwAttrs->rxDMAChannelIndex & 0x0F));
                    }

                    /* Post-flow-on unlock */
                    HwiP_restore(key);
                }
            }
        } else {
            /* Start the timer, or again, as we've either expired a read sequence or this
             * is our first iteration through and we have bytes in our buffer, so we are going
             * to return the the caller with the buffer on a timeout, or directly after a byte
             * stream is received
             * Note: This timer count will be overwritten by the Rx DMA Scatter Gatherer continuously
             * while receiving characters from the UART, meaning a stream of data will push out this
             * timeout until a DMA buffer toggles ping-pong, so quite large potentially?
             * ~ > (ring_buffer_size / 2). But really, if the timeout value has been configured as
             * 10ms, then 1,150 bytes will be received in this time, which is likely greater than
             * the size of the ring-buffer anyway... so we will get notification
             */
            Timer_start(object->timeoutTmr);
            /* Wait for the interrupt or DMA functions to post to the
             * semaphore, meaning data available to read, or a timeout occurred
             */
            SemaphoreP_pend(object->readSem, SemaphoreP_WAIT_FOREVER);
        }
    }

    SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartReadExit, (uintptr_t)handle, readCount, object->readBuffer.count);

    return readCount;
}

/*
 *  ======== UARTMSP432DMA_readCancel ========
 *  If there is no valid ReadBuf then we have
 *  no active listener... so just return quickly
 */
long UARTMSP432DMA_readCancel(UART_Handle handle)
{
    return UARTMSP432DMA_timeoutIntRx(NULL, (uintptr_t)handle);
}

/*
 *  ======== configTransmitDMA ========
 *  This functions configures the transmit DMA channels for a given
 *  buffer and length
 */
static int configTransmitDMA(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs)
{
    /* Cannot call into this multiple times, let current transfer finish */
    if (object->writeBuffer.reserved < object->writeBuffer.count && (( ( *object->tx_dmaCtrlAlt | *object->tx_dmaCtrlPri ) & 0x07 ) == 0))
    {
        uint32_t writeFree[2] = { object->tx_transfer.specs[eUDMAPingPongPrimary].size,
                                  object->tx_transfer.specs[eUDMAPingPongAlternate].size };
        uint32_t writeAloc[2] = { 0, 0};
        uint8_t writeUnblockRequired = 0;

        /* Catch any iterations that hanv't yet received the DMA Completion interrupt, but are
         * about to make modifications to the currentXferAmt, this shouldn't get executed often.
         * Its more of a race condition defensive piece.. perhaps its never executed. but still.
         */
        if (object->tx_transfer.specs[eUDMAPingPongPrimary].size) {
           RingBuf_free_get_contiguous(&object->writeBuffer, object->tx_transfer.specs[eUDMAPingPongPrimary].size );
           writeUnblockRequired = true;
        }
        if (object->tx_transfer.specs[eUDMAPingPongAlternate].size) {
           RingBuf_free_get_contiguous(&object->writeBuffer, object->tx_transfer.specs[eUDMAPingPongAlternate].size );
           writeUnblockRequired = true;
        }

        /* Allocate the new buffer(s) and setup the ping-pong transfer accordingly */
        if (object->tx_transfer.specs[eUDMAPingPongPrimary].size =
               RingBuf_alloc_get_contiguous(&object->writeBuffer, object->ringBlkSize,
                                            (uint8_t **)&object->tx_transfer.specs[eUDMAPingPongPrimary].src))
            writeAloc[0] = object->tx_transfer.specs[eUDMAPingPongPrimary].size;

        if(object->tx_transfer.specs[eUDMAPingPongAlternate].size =
               RingBuf_alloc_get_contiguous(&object->writeBuffer, object->ringBlkSize,
                                            (uint8_t **)&object->tx_transfer.specs[eUDMAPingPongAlternate].src))
            writeAloc[1] = object->tx_transfer.specs[eUDMAPingPongAlternate].size;

        if (object->tx_transfer.specs[eUDMAPingPongPrimary].size != 0) {
            //DMA_Control->ALTCLR = 1 << (hwAttrs->txDMAChannelIndex & 0x0F);

            //MAP_DMA_clearInterruptFlag(hwAttrs->txDMAChannelIndex & 0x0F);
            //MAP_UART_clearInterruptFlag(hwAttrs->baseAddr, EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG);

            if (object->tx_transfer.specs[eUDMAPingPongAlternate].size && object->writeBuffer.reserved < object->writeBuffer.count) {
                object->tx_transfer.transferMode = UDMA_MODE_PINGPONG;
            } else {
                object->tx_transfer.transferMode = UDMA_MODE_BASIC;
            }
            /* Ensure the alt select is cleared before we trigger this transfer */
            DMA_Control->ALTCLR = 1 << (hwAttrs->txDMAChannelIndex & 0x0F);

            UDMAMSP432_setupPingPongTransfer(&object->tx_transfer);

            /* Check if the COMPLETE_INTERRUPT_FLAG is set, meaning we need to kick this channel into submission
             * Note; I found that the first pass to setupPingPong would immediately action the DMA transfer
             *       for the send, however every other setup would not action the DMA at all.. not unless a manual
             *       transmission or done first, or a kick like this occurred. Doing a manual transmission seemed
             *       to also have its flaws, where the first transmission would kick off the DMA to overwrite its
             *       first byte and then sync is lost right away. I found that this interrupt flag is only set
             *       after the first pass, so its a good indicator if we're in that hole and need to kick it every
             *       time we want to get going again. Maybe there is a better way around this problem? Means to an
             *       end.... */
            if (MAP_UART_getInterruptStatus(hwAttrs->baseAddr, EUSCI_A_UART_TRANSMIT_INTERRUPT_FLAG)
            || !MAP_UART_queryStatusFlags(hwAttrs->baseAddr, EUSCI_A_UART_BUSY)) {
                /* If this is set, then the buffer has not been written to... */
                MAP_DMA_requestSoftwareTransfer(hwAttrs->txDMAChannelIndex & 0x0F);
            }
        } else {
            SEGGER_SYSVIEW_Error("DMA Transfer size incorrect, this would cause a DMA error");
        }

        return writeUnblockRequired;

        /* Keep all SEGGER logging here otherwise the debugger may cause a halt and prevent this from operating correctly */
        /*SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteFree, (uintptr_t)object, eUDMAPingPongPrimary, writeFree[0]);
        SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteFree, (uintptr_t)object, eUDMAPingPongAlternate, writeFree[1]);

        SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteAlloc, (uintptr_t)object, eUDMAPingPongPrimary, writeAloc[0]);
        SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteAlloc, (uintptr_t)object, eUDMAPingPongAlternate, writeAloc[1]); */

