ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    } else if ( (object->writeBuffer.count > object->writeBuffer.reserved) && (
             MAP_UART_getInterruptStatus(hwAttrs->baseAddr, EUSCI_A_UART_TRANSMIT_INTERRUPT_FLAG)
         || !MAP_UART_queryStatusFlags(hwAttrs->baseAddr, EUSCI_A_UART_BUSY)) ) {
       /* This is a 'catch-all' check to see if there are additional bytes to be sent and the
        * transmit queue is NOT marching forward, and is setup to do so.. Not sure why but
        * when the ring-buffer wraps around , the firs transfer just stalls. Harray. Perhaps
        * its that the first transfer is smaller than the second, and thus it stalls. As if the
        * DMA controller gets hung up on the transfer size mis-match when Primary < Secondary.
        */

       MAP_DMA_requestSoftwareTransfer(hwAttrs->txDMAChannelIndex & 0x0F);
    }

    return false;
}

/*
 *  ======== UARTMSP432DMA_hwiIntTxDMA_done ========
 */

static long UARTMSP432DMA_hwiIntTxDMA_done(uintptr_t arg)
{
    UARTMSP432DMA_Object *object = ((UART_Handle) arg)->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = ((UART_Handle) arg)->hwAttrs;
    uintptr_t   key;
    uint8_t     writeUnblock = 0;
    MAP_DMA_clearInterruptFlag(hwAttrs->txDMAChannelIndex & 0x0F);

    /*
     * Notes: 1) Adding SEGGER SysView logging here made he problem of missing Tx worse. The altered
     * timing
     */

    /* Check if we have more bytes to send and the DMA is stopped, in which case
     * start it back up, otherwise if we're running then setup the next buffer.
     * The next buffer is either alternate or primary depending on the bit state
     * within DMA_Control. Guard against setting any DMA register to zero or something
     * that will cause a DMA Fault condition.
     */
    if ( ( ( *object->tx_dmaCtrlAlt | *object->tx_dmaCtrlPri ) & 0x07 ) == 0 ) {

        if (object->writeBuffer.count == 0) {
            /* We're all stopped, so clean up any and all resources associated with the previous transfers */
            if (object->tx_transfer.specs[eUDMAPingPongPrimary].size) {
                RingBuf_free_get_contiguous(&object->writeBuffer, object->tx_transfer.specs[eUDMAPingPongPrimary].size );
                object->written += object->tx_transfer.specs[eUDMAPingPongPrimary].size;
                //SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteFree, (uintptr_t)arg, eUDMAPingPongPrimary, object->tx_transfer.specs[eUDMAPingPongPrimary].size);
                object->tx_transfer.specs[eUDMAPingPongPrimary].size = 0;
                writeUnblock = 1;
            }
            if (object->tx_transfer.specs[eUDMAPingPongAlternate].size) {
                RingBuf_free_get_contiguous(&object->writeBuffer, object->tx_transfer.specs[eUDMAPingPongAlternate].size );
                object->written += object->tx_transfer.specs[eUDMAPingPongAlternate].size;
                //SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteFree, (uintptr_t)arg, eUDMAPingPongAlternate, object->tx_transfer.specs[eUDMAPingPongAlternate].size);
                object->tx_transfer.specs[eUDMAPingPongAlternate].size = 0;
                writeUnblock = 1;
            }
            /* Remove constraints set during transfer */
            Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
        } else {
            /* Re-configure the tx transfer as we're currently stopped
             * but have more bytes to send on out */
            writeUnblock = configTransmitDMA(object, hwAttrs);
        }
    } else if (object->writeBuffer.reserved < object->writeBuffer.count) {
        key = HwiP_disable();
        uint32_t dmaChannel = object->tx_transfer.dmaChannel;
        eUDMAPingPong eBuffer = eUDMAPingPongPrimary;

        /* Are we on the primary buffer AND we still have bytes to send? then populate the alternate buffer */
        /* Are we on the alternate buffer AND we have nothing more to send? then populate the alternate buffer */
        /* In all other cases, we are processing the primary buffer */
        if ( ( (*object->tx_dmaAltSetBitBand == 0) && (*object->tx_dmaCtrlPri & 0x07 != 0) )
          || ( (*object->tx_dmaAltSetBitBand == 1) && (*object->tx_dmaCtrlAlt & 0x07 == 0) ) ){
            dmaChannel |= UDMA_ALT_SELECT;
            eBuffer = eUDMAPingPongAlternate;
        }

        /* We're about to overwrite this buffer, so free any and all resources associated with it */
        if (object->tx_transfer.specs[eBuffer].size)
        {
            RingBuf_free_get_contiguous(&object->writeBuffer, object->tx_transfer.specs[eBuffer].size );
            object->written += object->tx_transfer.specs[eBuffer].size;
            writeUnblock = 1;
            // SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteFree, (uintptr_t)arg, eBuffer, object->tx_transfer.specs[eBuffer].size);
        }

        /* The next write buffer is an alternate buffer size beyond the alternate buffer pointer, wrapped by the length
         * of the ring buffer
         */
        object->tx_transfer.specs[eBuffer].size = RingBuf_alloc_get_contiguous(
           &object->writeBuffer, object->ringBlkSize, (uint8_t **)&object->tx_transfer.specs[eBuffer].src );

        //SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteAlloc, (uintptr_t)arg, eBuffer, object->tx_transfer.specs[eBuffer].size);

        if (object->tx_transfer.specs[eBuffer].size > object->ringBlkSize) {
            //SEGGER_SYSVIEW_Error("object->tx_transfer.specs[eBuffer].size > object->ringBlkSize");
        } else {
            MAP_DMA_setChannelControl(dmaChannel, object->tx_transfer.ctlOptions);
            if (object->writeBuffer.reserved < object->writeBuffer.count ) {
                MAP_DMA_setChannelTransfer(dmaChannel, UDMA_MODE_PINGPONG,
                   object->tx_transfer.specs[eBuffer].src, object->tx_transfer.specs[eBuffer].dst,
                   object->tx_transfer.specs[eBuffer].size);
            } else {
                MAP_DMA_setChannelTransfer(dmaChannel, UDMA_MODE_BASIC,
                   object->tx_transfer.specs[eBuffer].src, object->tx_transfer.specs[eBuffer].dst,
                   object->tx_transfer.specs[eBuffer].size);
            }

