ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
            /* This will set the transfer mode to PING PONG and auto-transfer the next DMA transaction */
            if (eBuffer == eUDMAPingPongPrimary && *object->tx_dmaCtrlAlt & 0x07 != 0) {
                BITBAND_PERI((((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->txDMAChannelIndex & 0x0F) | UDMA_ALT_SELECT].control), 1) = 1;
            } else if ( eBuffer == eUDMAPingPongAlternate && *object->tx_dmaCtrlPri & 0x07 != 0) {
                BITBAND_PERI((((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->txDMAChannelIndex & 0x0F)].control), 1) = 1;
            }

        }
        HwiP_restore(key);
    }

#if 0
    /* If there is more data to transfer in the next switch then we should setup the next transfer now
     */
    if (object->tx_currentXferAmt) {
        /* Check if we're currently stopped, in which case we need to restart the Ping-Pong process instead
         * of just priming the next conversion to take place
         */
        if ( (*object->tx_dmaAltSetBitBand ? *object->tx_dmaCtrlAlt & 0x07 : *object->tx_dmaCtrlPri & 0x07 ) == 0 ) {
            /* Use the alloc_get ring buffer functions to reserve blocks from the buffer
             * to be put into transfer
             */
            configTransmitDMA(object, hwAttrs);

        } else if (*object->tx_dmaAltSetBitBand) {
            key = HwiP_disable();
            /* The next write buffer is an alternate buffer size beyond the alternate buffer pointer, wrapped by the length
             * of the ring buffer
             */
            object->tx_transfer.specs[eUDMAPingPongPrimary].size = RingBuf_alloc_get_contiguous(
                &object->writeBuffer, object->ringBlkSize, (uint8_t **)&object->tx_transfer.specs[eUDMAPingPongPrimary].src );
            if ()
            MAP_DMA_setChannelControl(object->tx_transfer.dmaChannel | UDMA_PRI_SELECT, object->tx_transfer.ctlOptions);
            MAP_DMA_setChannelTransfer(object->tx_transfer.dmaChannel | UDMA_PRI_SELECT, UDMA_MODE_PINGPONG,
                object->tx_transfer.specs[eUDMAPingPongPrimary].src, object->tx_transfer.specs[eUDMAPingPongPrimary].dst,
                object->tx_transfer.specs[eUDMAPingPongPrimary].size);
            HwiP_restore(key);
        } else {
            key = HwiP_disable();
            /* The next write buffer is a primary buffer size beyond the primary buffer pointer, wrapped by the length
             * of the ring buffer
             */
            object->tx_transfer.specs[eUDMAPingPongAlternate].size = RingBuf_alloc_get_contiguous(
                &object->writeBuffer, object->ringBlkSize, (uint8_t **)&object->tx_transfer.specs[eUDMAPingPongAlternate].src );
            MAP_DMA_setChannelControl(object->tx_transfer.dmaChannel | UDMA_ALT_SELECT, object->tx_transfer.ctlOptions);
            MAP_DMA_setChannelTransfer(object->tx_transfer.dmaChannel | UDMA_ALT_SELECT, UDMA_MODE_PINGPONG,
                object->tx_transfer.specs[eUDMAPingPongAlternate].src, object->tx_transfer.specs[eUDMAPingPongAlternate].dst,
                object->tx_transfer.specs[eUDMAPingPongAlternate].size);
            HwiP_restore(key);
        }
    } else if ((*object->tx_dmaAltSetBitBand ? *object->tx_dmaCtrlAlt & 0x07 : *object->tx_dmaCtrlPri & 0x07 ) == 0 ) {
        /* Disable the channel on the final pass through */
        //MAP_DMA_disableChannel(object->tx_transfer.dmaChannel & 0x0F);

        /* Remove constraints set during transfer */
        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
    }
#endif

    /* Only unblock the write semaphore if we actually made room in the send buffer, otherwise
     * no more data can be written. therefor why unblock it? only if there is space
     */
    return ( writeUnblock && SemaphoreP_post(object->writeSem) );
}

/*
 *  ======== getDmaRemainingXfers ========
 */
inline uint32_t getDmaRemainingTXfers(UARTMSP432DMA_Object *object)
{
   /* Use the bit-band addresses to determine how many bytes remaining in the transmit queue
    * and check if we'rd in the alt or primary structure in case we're using ping-pong instead
    * of regular transfer
    */
   if (*object->tx_dmaAltSetBitBand)
       return *object->tx_dmaCtrlAlt & 0x07 ? ((*object->tx_dmaCtrlAlt & UDMA_CHCTL_XFERSIZE_M) >> 4) + 1 : 0;
   else
       return *object->tx_dmaCtrlPri & 0x07 ? ((*object->tx_dmaCtrlPri & UDMA_CHCTL_XFERSIZE_M) >> 4) + 1 : 0;
}

/* ======== InitDmaRxScatterGatherer =========
 * Setup the Rx Scatter Gather channel to infinitely loop and trigger the Ping-Ping RX buffer
 */
static void InitDmaRxScatterGatherer(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs)
{
    /* Task 1: Trigger ping-pong buffer */
    DMA_ControlTable triggerPingPong =
           DMA_TaskStructEntry(1, UDMA_SIZE_32,
              UDMA_SRC_INC_NONE, &object->rx_dmaSwReq,
              UDMA_DST_INC_NONE, &DMA_Control->SWREQ,
              UDMA_ARB_4, (UDMA_MODE_MEM_SCATTER_GATHER));
    /* Task 2: Re-arm the idle timeout timer */
    DMA_ControlTable rearmTimeout =
           DMA_TaskStructEntry(1, UDMA_SIZE_32,
           UDMA_SRC_INC_NONE, &object->rx_dmaIdleControl,
           UDMA_DST_INC_NONE, object->rx_timer32ControlAdr,
           UDMA_ARB_4, (UDMA_MODE_MEM_SCATTER_GATHER));
    /* Task 3: Setup idle timeout as 2x Rx rate */
    DMA_ControlTable idleTimeout =
           DMA_TaskStructEntry(1, UDMA_SIZE_32,
              UDMA_SRC_INC_NONE, &object->rx_dmaIdleTimeout,
              UDMA_DST_INC_NONE, object->rx_timer32LoadAdr,
              UDMA_ARB_4, (UDMA_MODE_MEM_SCATTER_GATHER));
    /* Task 4: Reset task control size to enable looping this task list */
    DMA_ControlTable resetTask =
           DMA_TaskStructEntry(1, UDMA_SIZE_32,
              UDMA_SRC_INC_NONE, &object->rx_dmaTaskControl,
              UDMA_DST_INC_NONE, object->rx_dmaTaskCtrl,
              UDMA_ARB_4, (UDMA_MODE_PER_SCATTER_GATHER));

    /* Copy the structure above into the last list */
    object->rx_dmaTaskList[eTask1TriggerPingPongDMA]    = triggerPingPong;
    object->rx_dmaTaskList[eTask2ReloadIdleTimeout]     = idleTimeout;
    object->rx_dmaTaskList[eTask3RearmIdleTimer]        = rearmTimeout;
    object->rx_dmaTaskList[eTask4ResetTaskCount]        = resetTask;

    /* Setup scatter gatherer channels here */
    MAP_DMA_setChannelScatterGather(hwAttrs->rxDMAChannelIndex, eTaskMax, (void*)object->rx_dmaTaskList, 1);
    /*
     * ========== This is the money maker :) ==========
     * Buffer the DMA control element now it has been initialised with first values
     * calculated in the ROM functions. This will be copied back in the LAST task
     * in the scatter gatherer list with the control type set to PERIPHERAL SCATTER GATHERER
     * mode. The last part is very important because that makes the task list pause AFTER
     * the task list has been executes, and thus waits for another RX event. An endless loop
     * of DMA tasks.
     */
    object->rx_dmaTaskControl = *object->rx_dmaTaskCtrl;
    /* enable the channel and go */
    MAP_DMA_assignChannel(hwAttrs->rxDMAChannelIndex);
    MAP_DMA_clearInterruptFlag(hwAttrs->rxDMAChannelIndex & 0x0F);
    MAP_DMA_enableChannel(hwAttrs->rxDMAChannelIndex);
}
/*
 *  ======== initHw ========
 *
 *  Configures UART peripheral
 */
static void initHw(UARTMSP432DMA_Object *object, UARTMSP432DMA_HWAttrsV1 const *hwAttrs, uint32_t inputClkFreq)
{
    int32_t baudrateIndex;
    eUSCI_UART_Config uartConfig;

