ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /*
     * This will never return -1, constarints prevent unsupported performance
     * levels
     */
    baudrateIndex = findBaudDividerIndex(hwAttrs->baudrateLUT, hwAttrs->numBaudrateEntries, object->baudRate,
                                         inputClkFreq);

    uartConfig.selectClockSource = hwAttrs->clockSource;
    uartConfig.clockPrescalar = hwAttrs->baudrateLUT[baudrateIndex].prescalar;
    uartConfig.firstModReg = hwAttrs->baudrateLUT[baudrateIndex].hwRegUCBRFx;
    uartConfig.secondModReg = hwAttrs->baudrateLUT[baudrateIndex].hwRegUCBRSx;
    uartConfig.parity = parityTypes[object->parityType];
    uartConfig.msborLsbFirst = hwAttrs->bitOrder;
    uartConfig.numberofStopBits = stopBits[object->stopBits];
    uartConfig.uartMode = EUSCI_A_UART_MODE;
    uartConfig.overSampling = hwAttrs->baudrateLUT[baudrateIndex].oversampling;

    MAP_UART_initModule(hwAttrs->baseAddr, &uartConfig);

    /* Enable UART and disable its interrupts. */
    MAP_UART_disableInterrupt(hwAttrs->baseAddr,
                              EUSCI_A_UART_TRANSMIT_INTERRUPT |
                              EUSCI_A_UART_RECEIVE_INTERRUPT |
                              EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT |
                              EUSCI_A_UART_STARTBIT_INTERRUPT );
    MAP_UART_clearInterruptFlag(hwAttrs->baseAddr,
                                EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG |
                                EUSCI_A_UART_TRANSMIT_INTERRUPT_FLAG |
                                EUSCI_A_UART_STARTBIT_INTERRUPT_FLAG |
                                EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG);
    MAP_UART_enableInterrupt(hwAttrs->baseAddr,
                                 EUSCI_A_UART_BREAKCHAR_INTERRUPT |
                                 EUSCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT |
                                 EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT);
    MAP_UART_enableModule(hwAttrs->baseAddr);
    MAP_UART_enableInterrupt(hwAttrs->baseAddr,
                                     EUSCI_A_UART_BREAKCHAR_INTERRUPT |
                                     EUSCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT |
                                     EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT);
//#warning "Testing not firing this interrupt, seeing if DMA captures every completion OK"
    MAP_Interrupt_enableInterrupt(hwAttrs->intNum);

    /* Setup the RX DMA */
    UDMAMSP432_setupPingPongTransfer(&object->rx_transfer);
    /* Specify the buffer channel as having high priority */
    DMA_Control->PRIOSET = (1 << (hwAttrs->bfrDMAChannelIndex & 0x0F));
    baudrateIndex = EUSCI_A_CMSIS(hwAttrs->baseAddr)->RXBUF;

    /* Call setup route for DMA scatter gatherer */
    InitDmaRxScatterGatherer(object, hwAttrs);

    /* Clear the interrupt flags first */
    MAP_DMA_clearInterruptFlag(hwAttrs->txDMAChannelIndex & 0x0F);
    MAP_DMA_clearInterruptFlag(hwAttrs->bfrDMAChannelIndex & 0x0F);
    MAP_DMA_enableInterrupt(hwAttrs->dmaIntNum);

    MAP_Interrupt_enableInterrupt(hwAttrs->dmaIntNum);

    DebugP_log3("UART:(%p) CPU freq: %d; UART baudRate to %d", hwAttrs->baseAddr,
            inputClkFreq, object->baudRate);
}

/*
 *  ======== perfChangeNotifyFxn ========
 *
 *  Called by Power module before and after performance level is changed.
 */
static int perfChangeNotifyFxn(unsigned int eventType, uintptr_t eventArg, uintptr_t clientArg)
{
    uint32_t clockFreq;
    PowerMSP432_Freqs powerFreqs;
    UARTMSP432DMA_Object *object = ((UART_Handle) clientArg)->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = ((UART_Handle) clientArg)->hwAttrs;

    if (eventType == PowerMSP432_START_CHANGE_PERF_LEVEL)
    {
        /* Disable peripheral before performance level change */
        MAP_UART_disableModule(hwAttrs->baseAddr);
    }
    else
    { /* eventType == PowerMSP432_DONE_CHANGE_PERF_LEVEL */
        /* Get new performance level clock frequencies */
        PowerMSP432_getFreqs((unsigned int) eventArg, &powerFreqs);
        clockFreq = (hwAttrs->clockSource == EUSCI_A_UART_CLOCKSOURCE_SMCLK) ? powerFreqs.SMCLK : powerFreqs.ACLK;

        /* Reconfigure UART peripheral */
        initHw(object, hwAttrs, clockFreq);
    }

    return (Power_NOTIFYDONE);
}

/*
 *  ======== UARTMSP432DMA_close ========
 */
void UARTMSP432DMA_close(UART_Handle handle)
{
    unsigned int i;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    MAP_UART_disableInterrupt(hwAttrs->baseAddr,
    EUSCI_A_UART_RECEIVE_INTERRUPT | EUSCI_A_UART_TRANSMIT_INTERRUPT |
    EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT |
    EUSCI_A_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT |
    EUSCI_A_UART_BREAKCHAR_INTERRUPT);
    MAP_UART_clearInterruptFlag(hwAttrs->baseAddr,
    EUSCI_A_UART_TRANSMIT_INTERRUPT_FLAG |
    EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG |
    EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG);
    MAP_UART_disableModule(hwAttrs->baseAddr);

    if (object->hwiHandle)
    {
        HwiP_delete(object->hwiHandle);
    }
    if (object->writeSem)
    {
        SemaphoreP_delete(object->writeSem);
    }
    if (object->readSem)
    {
        SemaphoreP_delete(object->readSem);
    }
    if (object->timeoutTmr)
    {
        Timer_stop(object->timeoutTmr);
        Timer_close(object->timeoutTmr);
    }
    if (object->txdmaHandle)
    {
        UDMAMSP432_close(object->txdmaHandle, hwAttrs->txDMAChannelIndex, hwAttrs->dmaIntNum);
        object->txdmaHandle = NULL;
    }
    if (object->rxdmaHandle)
    {
       UDMAMSP432_close(object->rxdmaHandle, hwAttrs->rxDMAChannelIndex, hwAttrs->dmaIntNum);
       object->rxdmaHandle = NULL;
    }
    if (object->rxdmaBfrHandle)
    {
       UDMAMSP432_close(object->rxdmaBfrHandle, hwAttrs->bfrDMAChannelIndex, hwAttrs->dmaIntNum);
       object->rxdmaBfrHandle = NULL;
    }
    /* Remove power constraints */
    for (i = 0; object->perfConstraintMask; i++)
    {
        if (object->perfConstraintMask & 0x01)
        {
            Power_releaseConstraint(PowerMSP432_DISALLOW_PERFLEVEL_0 + i);
        }
        object->perfConstraintMask >>= 1;
    }
    if (DMA_Control->REQMASKSET & (1 << (hwAttrs->rxDMAChannelIndex & 0x0F)) == 0)
    {
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
        Power_releaseConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif
        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
    } else {
        DMA_Control->REQMASKCLR = (1 << (hwAttrs->rxDMAChannelIndex & 0x0F));
    }
    Power_unregisterNotify(&object->perfChangeNotify);

    object->state.opened = false;

    DebugP_log1("UART:(%p) closed", hwAttrs->baseAddr);
}

