ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
/*
 *  ======== UARTMSP432DMA_control ========
 *  @pre    Function assumes that the handle is not NULL
 */

int_fast16_t UARTMSP432DMA_control(UART_Handle handle, uint_fast16_t cmd, void *arg)
{
    int bufferCount;
    unsigned char data;
    uintptr_t key;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    if (cmd <= UART_CMD_RXDISABLE) {
        /* Call the DMA Ping-Pong peek routine as we NEED to know
         * the actual size of the buffer now
         */

        /* Pre-peek lock */
        key = HwiP_disable();

        /* Perform a read ping-pong peek so the true size of the receive buffer
         * is known before the semaphore is posted, unblocking the reader
         */
        UARTMSP432DMA_ReadPingPongPeek(handle);

        bufferCount = object->readBuffer.count;

        /* Post-peek unlock */
        HwiP_restore(key);
    } else if (cmd <= UART_CMD_TXENABLE) {
        bufferCount = object->writeBuffer.count;

    }

    switch (cmd)
    {
    /* Common UART CMDs */
    case (UART_CMD_PEEK):
        *(int *) arg = RingBuf_peek(&object->readBuffer, &data) ? data : UART_ERROR;
        DebugP_log2("UART:(%p) UART_CMD_PEEK: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
        return (UART_STATUS_SUCCESS);

    case (UART_CMD_ISAVAILABLE):
        *(bool *) arg = (bufferCount != 0);
        DebugP_log2("UART:(%p) UART_CMD_ISAVAILABLE: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
        return (UART_STATUS_SUCCESS);

    case (UART_CMD_GETRXCOUNT):
        *(int *) arg = bufferCount;
        DebugP_log2("UART:(%p) UART_CMD_GETRXCOUNT: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
        return (UART_STATUS_SUCCESS);

    case (UART_CMD_RXENABLE):
        /* Only re-enable RX if the buffer is NOT FULL ! */
        if (object->readBuffer.count < object->readBuffer.length) {
            /* Check we have ANY space left.. if we do, the DMA channel CAN be un-masked
             * with caution to the caller.. re-enabling the RX buffer with an extremely
             * full buffer may result in an overflow... you've been warned
             */
            if (DMA_Control->REQMASKSET & (1 << (hwAttrs->rxDMAChannelIndex & 0x0F))) {
                /* Pre-peek lock */
                key = HwiP_disable();

                /* RX Enable status is define by the REQMASK flag in the DMA controller
                 * and not by any other means. Once the driver has been stared the DMA
                 * free runs, so really a boolean flag is as useless as.... on a nun..
                 */
                DMA_Control->REQMASKCLR = 1 << (hwAttrs->rxDMAChannelIndex & 0x0F);

                /* We have just unmasked the DMA channel, it could now have a pending transfer
                 * which has not been auctioned because the channel was masked before the interrupt
                 * Occurred. Manually trigger the DMA channel to spring life back into the receive
                 * DMA transaction machine
                 */
                if (MAP_UART_getInterruptStatus(hwAttrs->baseAddr, EUSCI_A_UART_RECEIVE_INTERRUPT_FLAG))
                {
                    DMA_Control->SWREQ = (1 << (hwAttrs->rxDMAChannelIndex & 0x0F));
                }

                /* Post-peek unlock */
                HwiP_restore(key);
            }
            /* If we're below a high water mark then clear the RTS signal to allow flow control to
             * do gods work
             */
            if (object->readBuffer.count < (object->readBuffer.length - object->ringBlkSize)) {
                /* clear the RTS if hardware flow control pins have been defined */
                if (object->rtsPinBitBand != NULL) {
                    *object->rtsPinBitBand = 0x0000;
                }
            }

            /*
             * Set power constraints to keep peripheral active receiving
             * RX interrupts and prevent a performance level change.
             */
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
            Power_setConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif
            Power_setConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

            DebugP_log1("UART:(%p) UART_CMD_RXENABLE: Enabled",
                    hwAttrs->baseAddr);DebugP_log1("UART:(%p) UART_control set read power constraint",
                    hwAttrs->baseAddr);
            return (UART_STATUS_SUCCESS);
        }
        DebugP_log1("UART:(%p) UART_CMD_RXENABLE: Already enabled",
                hwAttrs->baseAddr);
        return (UART_STATUS_ERROR);

    case (UART_CMD_RXDISABLE):
        /* Check the REQMASKSET register to determine if we're disabled or not. This
         * allows the read and readAsyn functions to re-enable RX on first read without
         * worrying about a pesky rx_enable flag.
         */
        if (DMA_Control->REQMASKSET & (1 << (hwAttrs->rxDMAChannelIndex & 0x0F)) == 0)
        {
            /* Pre-peek lock */
            key = HwiP_disable();

            /* Asser RTS if hardware flow control pins have been defined */
            if (object->rtsPinBitBand != NULL) {
                *object->rtsPinBitBand = 0x0001;
            }

            /* RX Enable status is define by the REQMASK flag in the DMA controller
             * and not by any other means. Once the driver has been stared the DMA
             * free runs, so really a boolean flag is as useless as.... on a nun..
             */
            DMA_Control->REQMASKSET = 1 << (hwAttrs->rxDMAChannelIndex & 0x0F);

            /* Post-peek unlock */
            HwiP_restore(key);

            /*
             * Remove constraints, this will allow the device to enter
             * LPM3 and higher as well as allow performance level changes
             * by the application.
             */
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
            Power_releaseConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif
            Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

            DebugP_log1("UART:(%p) UART_CMD_RXDISABLE: Disabled",
                    hwAttrs->baseAddr);DebugP_log1("UART:(%p) UART_control released read power "
                    "constraint", hwAttrs->baseAddr);
            return (UART_STATUS_SUCCESS);
        }
        DebugP_log1("UART:(%p) UART_CMD_RXDISABLE: Already disabled",
                hwAttrs->baseAddr);
        return (UART_STATUS_ERROR);

    case (UART_CMD_ISACTIVE):
        *(bool *) arg = (bufferCount != 0);
        DebugP_log2("UART:(%p) UART_CMD_ISACTIVE: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
        return (UART_STATUS_SUCCESS);
    case (UART_CMD_GETTXCOUNT):
        *(int *) arg = bufferCount;
        DebugP_log2("UART:(%p) UART_CMD_GETTXCOUNT: %d", hwAttrs->baseAddr,
                *(uintptr_t*)arg);
        return (UART_STATUS_SUCCESS);
    case (UART_CMD_TXENABLE):
        if (DMA_Control->REQMASKSET & (1 << (hwAttrs->txDMAChannelIndex & 0x0F)))
        {
            /* Pre-peek lock */
            key = HwiP_disable();

            /* Un-mask the channel */
            DMA_Control->REQMASKCLR = 1 << (hwAttrs->txDMAChannelIndex & 0x0F);

            /* Check if there are bytes remaining to be sent in the DMA control */
            if (object->writeBuffer.count)
            {
                /* Configure the Tx DMA again from scratch */
                configTransmitDMA(object, hwAttrs);

