ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
                DebugP_log1("UART:(%p) UART_CMD_TXENABLE: Continue",
                        hwAttrs->baseAddr);
            }
            else
            {
                DebugP_log1("UART:(%p) UART_CMD_TXENABLE: Enabled",
                        hwAttrs->baseAddr);
            }
            /* Post-peek unlock */
            HwiP_restore(key);

            return (UART_STATUS_SUCCESS);
        }
        DebugP_log1("UART:(%p) UART_CMD_TXENABLE: Already enabled",
                hwAttrs->baseAddr);
        return (UART_STATUS_ERROR);
    case (UART_CMD_TXDISABLE):
        if (DMA_Control->REQMASKSET & (1 << (hwAttrs->txDMAChannelIndex & 0x0F)) == 0)
        {
            /* Mask the transmit ping-ping channel so it naturally stops processing new
             * requests.
             */
            DMA_Control->REQMASKSET = 1 << (hwAttrs->txDMAChannelIndex & 0x0F);

            /* Complete any outstanding transmit routines which will unblock
             * any active callers to transmit and allow them to return. Bytes in
             * the buffer already will still be sent, they are not removed from
             * the send queue, otherwise half messages would get out. SOftware must
             * handle what to do in this case.. but you likely already know because
             * you called TX Disable anyway.
             */
            UARTMSP432DMA_transmitCancel(handle);

            /* At this point the DMA transmit channel will be closed */

            DebugP_log1("UART:(%p) UART_CMD_TXDISABLE: Disabled",
                    hwAttrs->baseAddr);
            return (UART_STATUS_SUCCESS);
        }
        DebugP_log1("UART:(%p) UART_CMD_TXDISABLE: Already disabled",
                hwAttrs->baseAddr);
        return (UART_STATUS_ERROR);

    default:
        DebugP_log2("UART:(%p) UART CMD undefined: %d",
                hwAttrs->baseAddr, cmd);
        return (UART_STATUS_UNDEFINEDCMD);
    }
}

/*
 *  ======== UARTMSP432DMA_hwiIntFxn ========
 *  Hwi function that processes UART interrupts.
 *
 *  @param(arg)         The UART_Handle for this Hwi.
 */

static long UARTMSP432DMA_hwiIntFxn(uintptr_t arg)
{
    uint32_t status;
    uint32_t errorFlags;
    UARTMSP432DMA_Object *object = ((UART_Handle) arg)->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = ((UART_Handle) arg)->hwAttrs;
    long xSwitch = 0;

    status = MAP_UART_getEnabledInterruptStatus(hwAttrs->baseAddr);

    errorFlags = MAP_UART_queryStatusFlags(hwAttrs->baseAddr,
    EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR |
    EUSCI_A_UART_PARITY_ERROR | EUSCI_A_UART_BREAK_DETECT |
    EUSCI_A_UART_RECEIVE_ERROR);

    /* Call the inline method receive to kick off any async read complete
     * rules
     */
    if (status & (EUSCI_A_UART_STARTBIT_INTERRUPT))
    {
        xSwitch |= UARTMSP432DMA_hwiIntRx(arg);
        MAP_UART_clearInterruptFlag(hwAttrs->baseAddr, EUSCI_A_UART_STARTBIT_INTERRUPT);
    }

    if (status & EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG)
    {
        /* Clear this flag so the transmit function doesn't pick this up as a Non-Completer */
        MAP_UART_clearInterruptFlag(hwAttrs->baseAddr, EUSCI_A_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG);
        return ( configTransmitDMA(object, hwAttrs) && SemaphoreP_post(object->writeSem) ) || xSwitch;
    }

    if (errorFlags)
    {
        xSwitch |= hwAttrs->errorFxn((UART_Handle) arg, errorFlags);

        /* Reading the rxData regs clear the error flags */
        /* Call this second so we dont trump over a previous read */
        status = EUSCI_A_CMSIS(hwAttrs->baseAddr)->RXBUF;
        (void)status;
    }

    return xSwitch;
}

/*
 *  ======== UARTMSP432DMA_init ========
 */
void
UARTMSP432DMA_init(UART_Handle handle)
{
    UDMAMSP432_init();
}

/*
 *  ======== UARTMSP432DMA_open ========
 */
UART_Handle UARTMSP432DMA_open(UART_Handle handle, UART_Params *params)
{
    unsigned int i;
    uintptr_t key;
    uint32_t clockFreq;
    uint8_t numPerfLevels;
    int32_t baudrateIndex;
    union
    {
        Timer_Params tmr_params;
        HwiP_Params hwiParams;
        SemaphoreP_Params semParams;
    } portsParams;
    PowerMSP432_Freqs powerFreqs;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;
    uint8_t pin;
    uint8_t port;
    uint8_t value;

    DebugP_assert((hwAttrs->clockSource == EUSCI_A_UART_CLOCKSOURCE_ACLK) ||
            (hwAttrs->clockSource == EUSCI_A_UART_CLOCKSOURCE_SMCLK));
    /* The DMA channel must be INT0 as all routines refere to this directly
     * because we need at minimum three channels, and this would be excessive
     * to write support for independent and generic INT0 routines.
     */
    DebugP_assert((hwAttrs->dmaIntNum == DMA_INT0));

    /* The ring buf block size MUST be greater than 32, otherwise bad things will happen,
     * along with equal or greater than 3 blocks allocated to the ping-pong for buffer
     * overrun support.
     */
    DebugP_assert((hwAttrs->ringBufBlockCnt >= 3) && ((hwAttrs->ringBufSize / hwAttrs->ringBufBlockCnt >= 32)));
    key = HwiP_disable();

    if (object->state.opened)
    {
        HwiP_restore(key);
        DebugP_log1("UART:(%p) already in use.", hwAttrs->baseAddr);
        return (NULL);
    }
    object->state.opened = true;

    HwiP_restore(key);

    port = PinConfigPort(hwAttrs->rxPin);
    value = PinConfigValue(hwAttrs->rxPin);

    if (value != 0)
    {
        pin = (hwAttrs->rxPin) & 0x7;
        mapPin(port, pin, value);
    }

    pin = PinConfigPin(hwAttrs->rxPin);
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(port, pin,
    GPIO_PRIMARY_MODULE_FUNCTION);

    port = PinConfigPort(hwAttrs->txPin);
    value = PinConfigValue(hwAttrs->txPin);

    if (value != 0)
    {
        pin = (hwAttrs->txPin) & 0x7;
        mapPin(port, pin, value);
    }

    pin = PinConfigPin(hwAttrs->txPin);
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(port, pin,
    GPIO_PRIMARY_MODULE_FUNCTION);

