ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /*
     * Add power management support - Disable performance transitions while
     * opening the driver is open.  This constraint remains active until a
     * UART_control() disables receive interrupts.  Afterwards performance
     * levels can be changed by the application.  A UART_control() call can
     * enable RX interrupts again and set the pertinent constraints.
     */
    Power_setConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

    /*
     * Verify that the driver can be opened at current performance level and
     * set constraints for other performance levels.
     */
    numPerfLevels = PowerMSP432_getNumPerfLevels();
    PowerMSP432_getFreqs(Power_getPerformanceLevel(), &powerFreqs);
    if (hwAttrs->clockSource == EUSCI_A_UART_CLOCKSOURCE_ACLK)
    {
        /*
         * Verify if driver can be opened with ACLK; ACLK does not change
         * in any performance level.
         */
        baudrateIndex = findBaudDividerIndex(hwAttrs->baudrateLUT, hwAttrs->numBaudrateEntries, params->baudRate,
                                             powerFreqs.ACLK);
        if (baudrateIndex == -1)
        {
            DebugP_log3("UART:(%p) unable to find a valid buadrate %d "
                    "configuration at clock input clock freq %d", hwAttrs->baseAddr,
                    params->baudRate, powerFreqs.ACLK);
            Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
            object->state.opened = false;
            return (NULL);
        }
        clockFreq = powerFreqs.ACLK;
    }
    else
    { /* hwAttrs->clockSource == EUSCI_A_UART_CLOCKSOURCE_SMCLK */
        baudrateIndex = findBaudDividerIndex(hwAttrs->baudrateLUT, hwAttrs->numBaudrateEntries, params->baudRate,
                                             powerFreqs.SMCLK);
        if (baudrateIndex == -1)
        {
            DebugP_log3("UART:(%p) unable to find a valid buadrate %d "
                    "configuration at clock input clock freq %d", hwAttrs->baseAddr,
                    params->baudRate, powerFreqs.SMCLK);
            Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
            object->state.opened = false;
            return (NULL);
        }
        clockFreq = powerFreqs.SMCLK;

        /*
         * SMCLK changes with performance levels.  Set constraints for
         * unsupported performance levels.
         */
        for (i = 0; i < numPerfLevels; i++)
        {
            PowerMSP432_getFreqs(i, &powerFreqs);
            baudrateIndex = findBaudDividerIndex(hwAttrs->baudrateLUT, hwAttrs->numBaudrateEntries, params->baudRate,
                                                 powerFreqs.SMCLK);
            if (baudrateIndex == -1)
            {
                /* Set constraint and keep track of it in perfConstraintMask */
                object->perfConstraintMask |= (1 << i);
                Power_setConstraint(PowerMSP432_DISALLOW_PERFLEVEL_0 + i);
            }
        }
    }

    /*
     * For MSP432P401x devices the DEEPSLEEP_0 constraint is set to allow the
     * UART peripheral to continue to receive data.  This constraint is not
     * used with later MSP432 devices, because on later devices the CPU can
     * enter deep sleep without stopping the UART peripheral.
     */
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
    Power_setConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif

    /* Register function to reconfigure peripheral on perf level changes */
    Power_registerNotify(&object->perfChangeNotify,
    PowerMSP432_START_CHANGE_PERF_LEVEL |
    PowerMSP432_DONE_CHANGE_PERF_LEVEL,
                         perfChangeNotifyFxn, (uintptr_t) handle);

    /* Create the Hwi for this UART peripheral */
    HwiP_Params_init(&(portsParams.hwiParams));
    portsParams.hwiParams.arg = (uintptr_t) handle;
    portsParams.hwiParams.priority = hwAttrs->intPriority;
    object->hwiHandle = HwiP_create(hwAttrs->intNum, UARTMSP432DMA_hwiIntFxn, &(portsParams.hwiParams));
    if (object->hwiHandle == NULL)
    {
        DebugP_log1("UART:(%p) HwiP_create() failed", hwAttrs->baseAddr);
        UARTMSP432DMA_close(handle);
        return (NULL);
    }

    SemaphoreP_Params_init(&(portsParams.semParams));
    portsParams.semParams.mode = SemaphoreP_Mode_BINARY;

    /* If write mode is blocking create a semaphore and set callback. */
    object->writeSem = SemaphoreP_create(0, &(portsParams.semParams));
    if (object->writeSem == NULL)
    {
        DebugP_log1("UART:(%p) SemaphoreP_create() failed.",
                hwAttrs->baseAddr);
        UARTMSP432DMA_close(handle);
        return (NULL);
    }

    /* If read mode is blocking create a semaphore and set callback. */
    object->readSem = SemaphoreP_create(0, &(portsParams.semParams));
    if (object->readSem == NULL)
    {
        DebugP_log1("UART:(%p) SemaphoreP_create() failed.",
                hwAttrs->baseAddr);
        UARTMSP432DMA_close(handle);
        return (NULL);
    }

    /* Initialize the hardware timer */
    if (hwAttrs->timeoutTmrIdx != -1)
    {
        TimerMSP432_HWAttrs const *tmrHwattrs;
        Timer_Params_init(&portsParams.tmr_params);

        portsParams.tmr_params.periodUnits = Timer_PERIOD_US;
        portsParams.tmr_params.timerMode = Timer_ONESHOT_CALLBACK;
        portsParams.tmr_params.period = params->readTimeout;
        portsParams.tmr_params.timerCallback = UARTMSP432DMA_timeoutIntRx;
        portsParams.tmr_params.timerCallbackArg = (uintptr_t) handle;

        /* Store the handle for the rx idle timer
         * .. This only supports Timer32 at the moment, due to scatter gather tasks
         * which do not call library methods
         */
        object->timeoutTmr = Timer_open(hwAttrs->timeoutTmrIdx, &portsParams.tmr_params);
        if (object->timeoutTmr == NULL)
        {
            DebugP_log1("UART:(%p) Timer_open() failed.", hwAttrs->baseAddr);
            UARTMSP432DMA_close(handle);
            return (NULL);
        }
        tmrHwattrs = (TimerMSP432_HWAttrs*)object->timeoutTmr->hwAttrs;
        object->rx_timer32LoadAdr = &TIMER32_CMSIS(tmrHwattrs->timerBaseAddress)->LOAD;
        object->rx_timer32ControlAdr = &TIMER32_CMSIS(tmrHwattrs->timerBaseAddress)->CONTROL;
    }
    else
    {
        DebugP_log1("UART:(%p) Timer_open(ASYNC.MUST.HAVE.TMR) failed.", hwAttrs->baseAddr);
        UARTMSP432DMA_close(handle);
        return (NULL);
    }

    /* Claim TX DMA resources */
    object->txdmaHandle = UDMAMSP432_open(hwAttrs->txDMAChannelIndex, hwAttrs->dmaIntNum, hwAttrs->intPriority,
                                          UARTMSP432DMA_hwiIntTxDMA_done,
                                          (uintptr_t) handle);
    if (object->txdmaHandle == NULL)
    {
        DebugP_log1("UART:(%p) UDMAMSP432_open() failed.", hwAttrs->baseAddr);
        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
        UARTMSP432DMA_close(handle);

        return (NULL);
    }

    /* Claim the RX buffer ping pong dma channel */
    object->rxdmaBfrHandle = UDMAMSP432_open(hwAttrs->bfrDMAChannelIndex, hwAttrs->dmaIntNum, hwAttrs->intPriority,
                                             UARTMSP432DMA_hwiIntRxDMA_done,
                                             (uintptr_t) handle);
    if (object->rxdmaBfrHandle == NULL)
    {
        DebugP_log1("UART:(%p) UDMAMSP432_open() failed.", hwAttrs->baseAddr);
        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
        UARTMSP432DMA_close(handle);

        return (NULL);
    }

