ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /* Claim RX DMA resources */
    object->rxdmaHandle = UDMAMSP432_open(hwAttrs->rxDMAChannelIndex, hwAttrs->dmaIntNum, hwAttrs->intPriority,
                                          UARTMSP432DMA_hwiIntRx,
                                          (uintptr_t) handle);
    if (object->rxdmaHandle == NULL)
    {
        DebugP_log1("UART:(%p) UDMAMSP432_open() failed.", hwAttrs->baseAddr);
        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);
        UARTMSP432DMA_close(handle);

        return (NULL);
    }

    /*
     * Initialize UART read buffer - will store received bytes until
     * UART_read is invoked.
     */
    object->ringBlkSize = hwAttrs->ringBufSize / hwAttrs->ringBufBlockCnt;
    object->ringBlkSizeMin = hwAttrs->ringBufBlockSizeMin;
    /* Multiply the ring buffer block count by the integer division of the ringBufSize so
     * that the size of the ring buffer is of equal proportions, otherwise small buffers
     * will cause issues during ping-pong transitions, at odd times
     */
    RingBuf_construct(&object->readBuffer, hwAttrs->ringBufPtr,
                      (object->ringBlkSize * hwAttrs->ringBufBlockCnt ));

    /*
     * Initialize UART write buffer - will store sending bytes during DMA transfer operations
     * and cause a block if the buffer is actually full
     */
    RingBuf_construct(&object->writeBuffer, hwAttrs->writeBufPtr, hwAttrs->writeBufSize);

    /*
     * Store UART parameters & initialize peripheral.  These are used to
     * re/initialize the peripheral when opened or changing performance level.
     */
    object->readTimeout = params->readTimeout;
    object->writeTimeout = params->writeTimeout;
    object->baudRate = params->baudRate;
    object->stopBits = params->stopBits;
    object->parityType = params->parityType;
    object->written = 0;
    object->rx_readMin = 0;
    object->readAsyncPrev = 0;
    object->tx_cancelInProgress = false;

    /* RTS Pin used for flow control of the RX buffer. Set once the highwater mark is met, meaning less than or equal
     * to one rx block size of buffer free. This allows for run-out during flow control transition and prevents
     * your receive queue being poisoned
     */
    object->rtsPinBitBand = hwAttrs->rtsPinBitBand;

    /* Variables used in the Rx scatter gather task list */
    object->rx_dmaIdleControl = TIMER32_CONTROL_ONESHOT | TIMER32_CONTROL_IE | TIMER32_CONTROL_ENABLE | TIMER32_CONTROL_MODE ;
    object->rx_dmaSwReq   = 1 << (hwAttrs->bfrDMAChannelIndex & 0x0F);
    object->rx_dmaIdleTimeout = (clockFreq / ( params->baudRate / 10 ) ) * 8;

    /* the ALT control bit is in peripheral address space */
    object->rx_dmaAltSetBitBand = (volatile uint32_t*)BITBAND_PERI_ADR(DMA_Control->ALTSET, (hwAttrs->bfrDMAChannelIndex & 0x0F));
    object->rx_dmaAltClrBitBand = (volatile uint32_t*)BITBAND_PERI_ADR(DMA_Control->ALTCLR, (hwAttrs->bfrDMAChannelIndex & 0x0F));
    object->rx_dmaCtrlPri  = &((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->bfrDMAChannelIndex & 0x0F)].control;
    object->rx_dmaCtrlAlt  = &((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->bfrDMAChannelIndex & 0x0F) | UDMA_ALT_SELECT].control;
    object->rx_dmaTaskCtrl = &((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->rxDMAChannelIndex & 0x0F)].control;

    /* tx DMA peripheral address access */
    object->tx_dmaAltSetBitBand = (volatile uint32_t*)BITBAND_PERI_ADR(DMA_Control->ALTSET, (hwAttrs->txDMAChannelIndex & 0x0F));
    object->tx_dmaAltClrBitBand = (volatile uint32_t*)BITBAND_PERI_ADR(DMA_Control->ALTCLR, (hwAttrs->txDMAChannelIndex & 0x0F));
    object->tx_dmaCtrlPri = &((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->txDMAChannelIndex & 0x0F)].control;
    object->tx_dmaCtrlAlt = &((DMA_ControlTable*)DMA_Control->CTLBASE)[(hwAttrs->txDMAChannelIndex & 0x0F) | UDMA_ALT_SELECT].control;

    /* Setup these constants so that interrupts call into them constantly... */
    object->tx_transfer.dmaChannel = hwAttrs->txDMAChannelIndex;
    object->tx_transfer.ctlOptions = UDMA_SIZE_8 | UDMA_SRC_INC_8 | UDMA_DST_INC_NONE | UDMA_ARB_1;
    object->tx_transfer.specs[eUDMAPingPongPrimary].dst = (void *) MAP_UART_getTransmitBufferAddressForDMA(hwAttrs->baseAddr);
    object->tx_transfer.specs[eUDMAPingPongAlternate].dst = (void *) MAP_UART_getTransmitBufferAddressForDMA(hwAttrs->baseAddr);
    object->tx_transfer.transferMode = UDMA_MODE_PINGPONG;
    /* Start with Nulls and Zero length for safety */
    object->tx_transfer.specs[eUDMAPingPongPrimary].size = 0;
    object->tx_transfer.specs[eUDMAPingPongAlternate].size = 0;
    object->tx_transfer.specs[eUDMAPingPongPrimary].src = NULL;
    object->tx_transfer.specs[eUDMAPingPongAlternate].src = NULL;

    /* Setup the ping-pong source and sizes */
    object->rx_transfer.dmaChannel = hwAttrs->bfrDMAChannelIndex;
    object->rx_transfer.ctlOptions = UDMA_SIZE_8 | UDMA_SRC_INC_NONE | UDMA_DST_INC_8 | UDMA_ARB_1;
    object->rx_transfer.specs[eUDMAPingPongPrimary].src = (void *) MAP_UART_getReceiveBufferAddressForDMA(hwAttrs->baseAddr);
    object->rx_transfer.specs[eUDMAPingPongAlternate].src = (void *) MAP_UART_getReceiveBufferAddressForDMA(hwAttrs->baseAddr);
    object->rx_transfer.transferMode = UDMA_MODE_PINGPONG;
    /* Initial pointers for the ping ping RX buffer */
    object->rx_transfer.specs[eUDMAPingPongPrimary].size =
            RingBuf_alloc_put_contiguous(&object->readBuffer, object->ringBlkSize,
                                         (unsigned char **)&object->rx_transfer.specs[eUDMAPingPongPrimary].dst);
    object->rx_transfer.specs[eUDMAPingPongAlternate].size =
            RingBuf_alloc_put_contiguous(&object->readBuffer, object->ringBlkSize,
                                         (unsigned char **)&object->rx_transfer.specs[eUDMAPingPongAlternate].dst);

    initHw(object, hwAttrs, clockFreq);

    DebugP_log1("UART:(%p) opened", hwAttrs->baseAddr);

    /* Return the handle */
    return (handle);
}

/*
 *  ======== SPIMSP432DMA_transferCancel ========
 */
void UARTMSP432DMA_transmitCancel(UART_Handle handle)
{
    uintptr_t key;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

