ArakniD/simplelink_msp432p4_sdk/source/ti/drivers/uart/UARTMSP432DMA.c
    /*
     * There are 2 use cases in which to call transferCancel():
     *   1.  The driver is in CALLBACK or ASYNC mode.
     *   2.  The driver is in BLOCKING mode & there has been a transfer timeout.
     */

    key = HwiP_disable();

    if (object->tx_cancelInProgress || object->writeBuffer.count == 0)
    {
        HwiP_restore(key);

        return;
    }
    object->tx_cancelInProgress = true;

    /* Clear DMA configuration */
    MAP_DMA_disableChannel(hwAttrs->txDMAChannelIndex & 0x0F);
    object->tx_transfer.specs[eUDMAPingPongPrimary].size = 0;
    object->tx_transfer.specs[eUDMAPingPongAlternate].size = 0;
    object->tx_dmaCtrlPri = 0;
    object->tx_dmaCtrlAlt = 0;

    /* Clear the entire send queue */
    RingBuf_free_get_contiguous(&object->writeBuffer, hwAttrs->writeBufSize);

    HwiP_restore(key);

    /* Remove constraints set during transfer */
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
    Power_releaseConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif
    Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

    /* Indicate we are done with this transfer */
    object->tx_cancelInProgress = false;
}

/*
 *  ======== UARTMSP432DMA_write ========
 */
int_fast32_t UARTMSP432DMA_write(UART_Handle handle, const void *buffer, size_t size)
{
    uintptr_t key;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;
    unsigned char *writePtr = (unsigned char*) buffer;
    unsigned int lwriteCount = 0;
    unsigned int count;

    if (!size)
    {
        return (0);
    }

    SEGGER_SYSVIEW_RecordU32x2(SYSVIEW_EID_uartWriteEnter, (uintptr_t)handle, size);

    /*
       * It is possible for the object->timeoutClk and the callback function to
       * have posted the object->readSem Semaphore from the previous UART_read
       * call (if the code below didn't get to stop the clock object in time).
       * To clear this, we simply do a NO_WAIT pend on (binary) object->readSem
       * so that it resets the Semaphore count.
       */
    SemaphoreP_pend(object->writeSem, SemaphoreP_NO_WAIT);

    /* Put the data into the send buffer */
    /* WARNING.. THIS OPERATION COULD BE A COPY OF UP TO BUFFER SIZE...IE 1024 bytes
     * which can take
     */
    /* Prep the DMA queue */
    key = HwiP_disable();
    /* Attempt to add the buffer to the send queue where possible */
    count = RingBuf_put_buffer(&object->writeBuffer, writePtr, size);

    configTransmitDMA(object, hwAttrs);
    size -= count;
    writePtr += count;
    lwriteCount = count;

    HwiP_restore(key);

    /*
     * Set power constraint to keep peripheral active during transfer and
     * to prevent a performance level change
     */
#if DeviceFamily_ID == DeviceFamily_ID_MSP432P401x
    Power_setConstraint(PowerMSP432_DISALLOW_DEEPSLEEP_0);
#endif
    Power_setConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

    while (size && (SemaphoreP_OK != SemaphoreP_pend(object->writeSem, object->writeTimeout)) ) {
        /* Always lock this out here, otherwise DMA could interrupt and mess with
         * our ring buffer without our knowledge
         */
        key = HwiP_disable();

        /* Put the data into the send buffer */
        count = RingBuf_put_buffer(&object->writeBuffer, writePtr, size);

        /* Configure the Xmit DMA to ping-pong away */
        configTransmitDMA(object, hwAttrs);

        /* Commentary: Technically if your Tx ping-pong buffers are small, you can return
         * quicker to the transmitter with available buffer space, instead of waiting giant
         * buffer sizes. Depends on your application.. I havn't implemented a send buffer
         * block size other than using the same size of the RX ring blocks.
         */
        size -= count;
        writePtr += count;
        lwriteCount += count;

        HwiP_restore(key);
    }

    if (size) {
        /* Semaphore timed out, make the write empty and log the write. */
        UARTMSP432DMA_transmitCancel(handle);

        if (object->written != 0) {
            DebugP_log2("UART:(%p) Write timed out, %d bytes written",
                    hwAttrs->baseAddr, object->written);
        }
    }

    /* Return the number of bytes written by the interrupt processes */
    object->written = 0;

    SEGGER_SYSVIEW_RecordU32x3(SYSVIEW_EID_uartWriteExit, (uintptr_t)handle, lwriteCount, object->writeBuffer.count );

    return (lwriteCount);
}

/*
 *  ======== UARTMSP432_readPolling ========
 */
int_fast32_t UARTMSP432DMA_readPolling (UART_Handle handle, void *buf, size_t size)
{
    int_fast32_t read;
    size_t  bufferSize = size;
    /*
     * if you're using this driver code you're not calling an actual polling method...
     *
     * ever...
     *
     * Just saying...
     *
     * /rantover
     *
     * Call the read in a loop until all bytes are received OR we get a read error
     */
    while ( (size > 0) && (read = UARTMSP432DMA_read(handle, buf, size)) >= 0) {
        buf = (void*)((uintptr_t)buf + (uintptr_t)read);
        size -= read;
    }

    /*
     * Either return the error code or return the amount
     * of bytes read into the buffer..
     */
   return read < 0 ? read : (bufferSize - size);
}

/*
 *  ======== UARTMSP432DMA_writePolling ========
 */
int_fast32_t UARTMSP432DMA_writePolling(UART_Handle handle, const void *buf, size_t size)
{
    size_t added;
    UARTMSP432DMA_Object *object = handle->object;
    UARTMSP432DMA_HWAttrsV1 const *hwAttrs = handle->hwAttrs;

    /* Use the DMA write call. except wait for every last byte to be written
     * to the output.. Thats the only difference here. Its more of a Write with
     * confirmation of completion
     */
    if ((added = UARTMSP432DMA_write(handle, buf, size)) == size)
    {
        while (getDmaRemainingTXfers(object) != 0 && SemaphoreP_pend(object->writeSem, SemaphoreP_WAIT_FOREVER) != SemaphoreP_TIMEOUT) ;

        DebugP_log2("UART:(%p) Write success, %d bytes written",
                        hwAttrs->baseAddr, added);

        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

        return size;
    } else {
        /* This shuts up the compiler warning */
        (void)added;
        (void)hwAttrs;
        DebugP_log2("UART:(%p) Write failed adding to transmit queue early finished, %d bytes written",
                hwAttrs->baseAddr, added);

        Power_releaseConstraint(PowerMSP432_DISALLOW_PERF_CHANGES);

        return UART_STATUS_ERROR;
    }
}

/*
 *  ======== mapPin ========
 */
static void mapPin(uint8_t port, uint8_t pin, uint8_t value)
{
    volatile uint8_t pmap;

    pmap = port * 0x8;  // 2 -> 0x10, 3 -> 0x18, 7 -> 0x38

    /*  Code from pmap.c: */
    /* Get write-access to port mapping registers */
    PMAP->KEYID = PMAP_KEYID_VAL;

    /* Enable reconfiguration during runtime */
    PMAP->CTL = (PMAP->CTL & ~PMAP_CTL_PRECFG) | PMAP_ENABLE_RECONFIGURATION;
    HWREG8((uint32_t)PMAP_BASE + pin + pmap) = value;

    /* Disable write-access to port mapping registers: */
    PMAP->KEYID = 0;
}
